{"_id":{"$oid":"5c88256434ec1a6dfb5f9eec"},"Title":"Silence of the Lambs","ReleaseYear":"1991","Description":"In the film, Clarice Starling, a young FBI trainee, seeks the advice of the imprisoned Dr. Hannibal Lecter, a brilliant psychiatrist and cannibalistic serial killer to apprehend another serial killer, known only as 'Buffalo Bill', who skins his female victims' corpses.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"5c882c7134ec1a6dfb5f9eed"},"Title":"One Flew Over the Cuckoo's Nest","ReleaseYear":"1975","Description":"A criminal pleads insanity after getting into trouble again and once in the mental institution rebels against the oppressive nurse and rallies up the scared patients.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Milos Forman","Bio":"Miloš Forman was a Czech American film director, screenwriter, actor and professor who, until 1968, lived and worked primarily in the former Czechoslovakia.","Birth":"1932","Death":"2018"},"ImagePath":"cuckoosnest.png","Featured":false}
{"_id":{"$oid":"5c882d8634ec1a6dfb5f9eee"},"Title":"This Is 40","ReleaseYear":"2012","Description":"Pete and Debbie are both about to turn 40, their kids hate each other, both of their businesses are failing, they're on the verge of losing their house, and their relationship is threatening to fall apart.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Judd Apatow","Bio":"Judd Apatow is an American producer, writer, director, actor and stand-up comedian.","Birth":"1967"},"ImagePath":"thiis40.png","Featured":false}
{"_id":{"$oid":"5c882e4c34ec1a6dfb5f9eef"},"Title":"It Happened One Night","ReleaseYear":"1934","Description":"A spoiled heiress running away from her family is helped by a man who is actually a reporter in need of a story.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Frank Capra","Bio":"Frank Russell Capra was an Italian American film director, producer and writer who became the creative force behind some of the major award-winning films of the 1930s and 1940s. Capra became one of America's most influential directors during the 1930s, winning three Academy Awards for Best Director from six nominations, along with three other Oscar wins from nine nominations in other categories.","Birth":"1897","Death":"1991"},"ImagePath":"Ithappenedonenight.png","Featured":false}
{"_id":{"$oid":"5c882ec834ec1a6dfb5f9ef0"},"Title":"It's a Wonderful Life","ReleaseYear":"1946","Description":"An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap. Fantasy films often have an element of magic, myth, wonder, escapism, and the extraordinary."},"Director":{"Name":"Frank Capra","Bio":"Frank Russell Capra was an Italian American film director, producer and writer who became the creative force behind some of the major award-winning films of the 1930s and 1940s. Capra became one of America's most influential directors during the 1930s, winning three Academy Awards for Best Director from six nominations, along with three other Oscar wins from nine nominations in other categories.","Birth":"1897","Death":"1991"},"ImagePath":"wonderfullife.png","Featured":false}
{"_id":{"$oid":"5c885bc134ec1a6dfb5f9ef1"},"Title":"Pulp Fiction","ReleaseYear":"1994","Description":"The lives of two mob hitmen, a boxer, a gangster's wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, are a cinematic genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection. Stylistically, the genre may overlap and combine with many other genres, such as drama or gangster film[1], but also include comedy, and, in turn, is divided into many sub-genres, such as mystery, suspense or noir."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American filmmaker, author, and actor. His films are characterized by nonlinear storylines; satirical subject matter; an aestheticization of violence; extended scenes of dialogue; ensemble casts consisting of established and lesser-known performers; references to popular culture and a wide variety of other films; soundtracks primarily containing songs and score pieces from the 1960s to the 1980s; and features of neo-noir film.","Birth":"1963"},"ImagePath":"pulpfiction.png","Featured":false}
{"_id":{"$oid":"5c885c4234ec1a6dfb5f9ef2"},"Title":"Kill Bill: Vol. 1","ReleaseYear":"2003","Description":"After awakening from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her.","Genre":{"Name":"Action","Description":"Action is a film genre in which the protagonist or protagonists are thrust into a series of challenges that typically include violence, extended fighting, physical feats, and frantic chases. Action films tend to feature a resourceful hero struggling against incredible odds, which include life-threatening situations, a villain, or a pursuit which usually concludes in victory for the hero (though a small number of films in this genre have ended in victory for the villain instead)."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American filmmaker, author, and actor. His films are characterized by nonlinear storylines; satirical subject matter; an aestheticization of violence; extended scenes of dialogue; ensemble casts consisting of established and lesser-known performers; references to popular culture and a wide variety of other films; soundtracks primarily containing songs and score pieces from the 1960s to the 1980s; and features of neo-noir film.","Birth":"1963"},"ImagePath":"killbill1.png","Featured":false}
{"_id":{"$oid":"5c885cd834ec1a6dfb5f9ef3"},"Title":"Fight Club","ReleaseYear":"1999","Description":"An insomniac office worker and a devil-may-care soapmaker form an underground fight club that evolves into something much, much more.","Genre":{"Name":"Action","Description":"Action is a film genre in which the protagonist or protagonists are thrust into a series of challenges that typically include violence, extended fighting, physical feats, and frantic chases. Action films tend to feature a resourceful hero struggling against incredible odds, which include life-threatening situations, a villain, or a pursuit which usually concludes in victory for the hero (though a small number of films in this genre have ended in victory for the villain instead)."},"Director":{"Name":"David Fincher","Bio":"David Fincher is an American film director, film producer, television director, television producer, and music video director. He was nominated for the Academy Award for Best Director for The Curious Case of Benjamin Button (2008) and The Social Network (2010). For the latter, he won the Golden Globe Award for Best Director and the BAFTA Award for Best Direction.","Birth":"1962"},"ImagePath":"fightclub.png","Featured":false}
{"_id":{"$oid":"5c88606534ec1a6dfb5f9ef4"},"Title":"Avatar","ReleaseYear":"2009","Description":"A paraplegic marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.","Genre":{"Name":"Science fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"James Cameron","Bio":"James Francis Cameron is a Canadian filmmaker, philanthropist, and deep-sea explorer who lives in the United States. After working in special effects, he found major success after directing and writing the science fiction action film The Terminator.","Birth":"1954"},"ImagePath":"avatar.png","Featured":false}
{"_id":{"$oid":"5c8860fa34ec1a6dfb5f9ef5"},"Title":"Inside out","ReleaseYear":"2015","Description":"After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school.","Genre":{"Name":"Animation","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Pete Docter","Bio":"Peter Hans Docter is an American animator, film director, screenwriter, producer, voice actor and chief creative officer of Pixar. He is best known for directing the animated feature films Monsters, Inc., Up and Inside Out and as a key figure and collaborator at Pixar.","Birth":"1968"},"ImagePath":"insideout.png","Featured":false}
{"_id":{"$oid":"5c8975bdb825ae1d81f1e2d5"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"Actors":["Anthony Hopkins","Jodie Foster","Kasi Lemmings"]}
